; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (arm-empty)
    (holding ?x - block)
    (clear ?x - block)
    (on ?x - block ?y - block)
    (on-table ?x - block)
  )

  (:action pickup
    :parameters (?x - block)
    :precondition (and (arm-empty) (clear ?x) (on-table ?x))
    :effect (and (not (arm-empty)) (holding ?x) (not (clear ?x)) (not 
(on-table ?x)))
  )

  (:action putdown
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (arm-empty) (not (holding ?x)) (clear ?x) (on-table ?x))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (arm-empty) (not (holding ?x)) (on ?x ?y) (clear ?x) (not 
(clear ?y)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (arm-empty) (on ?x ?y) (clear ?x))
    :effect (and (not (arm-empty)) (holding ?x) (clear ?y) (not (clear 
?x)) (not (on ?x ?y)))
  )
)

; problem
(define (problem multi-tower)
  (:domain blocksworld-4ops)
  (:objects A B C D E - block)
  (:init (arm-empty)
         (on-table A) (on B A) (on C B) (clear C)
         (on-table D) (on E D) (clear E))
  (:goal (and (on A C) (on-table C)
              (on B E) (on-table E)
              (on D B))))

; plan
1. (unstack c b)
   deleted: (arm-empty) (clear c) (on c b)
   added: (holding c) (clear b)
   goals met: 0 of 5
2. (putdown c)
   deleted: (holding c)
   added: (arm-empty) (clear c) (on-table c)
   goals met: 1 of 5
3. (unstack e d)
   deleted: (arm-empty) (clear e) (on e d)
   added: (holding e) (clear d)
   goals met: 1 of 5
4. (putdown e)
   deleted: (holding e)
   added: (arm-empty) (clear e) (on-table e)
   goals met: 2 of 5
5. (unstack b a)
   deleted: (arm-empty) (clear b) (on b a)
   added: (holding b) (clear a)
   goals met: 2 of 5
6. (stack b e)
   deleted: (holding b) (clear e)
   added: (arm-empty) (on b e) (clear b)
   goals met: 3 of 5
7. (pickup a)
   deleted: (arm-empty) (clear a) (on-table a)
   added: (holding a)
   goals met: 3 of 5
8. (stack a c)
   deleted: (holding a) (clear c)
   added: (arm-empty) (on a c) (clear a)
   goals met: 4 of 5
9. (pickup d)
   deleted: (arm-empty) (clear d) (on-table d)
   added: (holding d)
   goals met: 4 of 5
10. (stack d b)
   deleted: (holding d) (clear b)
   added: (arm-empty) (on d b) (clear d)
   goals met: 5 of 5
